{"class_name": "Functional", "config": {"name": "bwunet", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "bwunet_input"}, "name": "bwunet_input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "emb", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}}, "name": "emb", "inbound_nodes": [[["bwunet_input", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "emb_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "emb_prelu", "inbound_nodes": [[["emb", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc0", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}}, "name": "enc0", "inbound_nodes": [[["emb_prelu", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "enc0_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "enc0_prelu", "inbound_nodes": [[["enc0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}}, "name": "enc1", "inbound_nodes": [[["enc0_prelu", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "enc1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "enc1_prelu", "inbound_nodes": [[["enc1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}}, "name": "enc2", "inbound_nodes": [[["enc1_prelu", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "enc2_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "enc2_prelu", "inbound_nodes": [[["enc2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}}, "name": "enc3", "inbound_nodes": [[["enc2_prelu", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "enc3_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "enc3_prelu", "inbound_nodes": [[["enc3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "flat0", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}}, "name": "flat0", "inbound_nodes": [[["enc3_prelu", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "flat0_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "flat0_prelu", "inbound_nodes": [[["flat0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "flat1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}}, "name": "flat1", "inbound_nodes": [[["flat0_prelu", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "flat1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "flat1_prelu", "inbound_nodes": [[["flat1", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "dec3_tconv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}, "output_padding": null}, "name": "dec3_tconv", "inbound_nodes": [[["flat1_prelu", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["dec3_tconv", 0, 0, {}], ["enc2", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "dec3_prelua", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "dec3_prelua", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "dec3_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}}, "name": "dec3_conv", "inbound_nodes": [[["dec3_prelua", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "dec3_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "dec3_prelu", "inbound_nodes": [[["dec3_conv", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "dec2_tconv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}, "output_padding": null}, "name": "dec2_tconv", "inbound_nodes": [[["dec3_prelu", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["dec2_tconv", 0, 0, {}], ["enc1", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "dec2_prelua", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "dec2_prelua", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "dec2_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}}, "name": "dec2_conv", "inbound_nodes": [[["dec2_prelua", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "dec2_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "dec2_prelu", "inbound_nodes": [[["dec2_conv", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "dec1_tconv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}, "output_padding": null}, "name": "dec1_tconv", "inbound_nodes": [[["dec2_prelu", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["dec1_tconv", 0, 0, {}], ["enc0", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "dec1_prelua", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "dec1_prelua", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "dec1_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}}, "name": "dec1_conv", "inbound_nodes": [[["dec1_prelua", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "dec1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "dec1_prelu", "inbound_nodes": [[["dec1_conv", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "dec0_tconv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}, "output_padding": null}, "name": "dec0_tconv", "inbound_nodes": [[["dec1_prelu", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes": [[["dec0_tconv", 0, 0, {}], ["emb", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "dec0_prelua", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "dec0_prelua", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "dec0_conv", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}}, "name": "dec0_conv", "inbound_nodes": [[["dec0_prelua", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "dec0_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "dec0_prelu", "inbound_nodes": [[["dec0_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "last1", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}}, "name": "last1", "inbound_nodes": [[["dec0_prelu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["last1", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "last1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "last1_prelu", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "last0", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": [0, 1, 2]}, "registered_name": null}, "bias_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": 0.0, "max_value": true, "rate": 1, "axis": 0}, "registered_name": null}}, "name": "last0", "inbound_nodes": [[["last1_prelu", 0, 0, {}]]]}], "input_layers": [["bwunet_input", 0, 0]], "output_layers": [["last0", 0, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}